Show / Hide Table of Contents
Enum SetupValueEc2
Setup value types Ec2
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum SetupValueEc2
Fields
 Name |  Description
 AllowCheckInAgeLess3Days
true to allow check in concrete age less than 3 days
 AlphaCw
AlphaCw
 AnchorageDetailType
anchorage of reinforcement according to type
 BentUpBarsReduction
reduction coefficinet of bent-up bars
 BLRPRecisionCheckValue
precision of bridge load rating - check value
 CalculateShrinkage
calculate influence of shrinkage to stiffnesses
 CalculateSrMaxAccUserSettings
sr,max, is calculated according to user
 CalculationOfStressLimitationK1
calculation of stress limitation k1
 CalculationOfStressLimitationK2
calculation of stress limitation k2
 CalculationOfStressLimitationK3
calculation of stress limitation k3
 CoeffCrdc
CoeffCrdc
 CoefficientOfTensionConcrete
coefficient witch reduce the tension strength
 CoeffK1
CoeffK1
 CoeffKl
lateral shear - coefficient k (6.2.4 (6))
 CoeffKp
CoeffKp
 CoeffNi
strength reduction factor
 CoeffNi1
CoeffNi1
 CoeffNi1_EN2_2
coeff ni1 for EN2-2
 CoeffVmin
CoeffVmin
 CracksPassThrough
CracksPassThrough
 CracWidthNationalAnnex
use some annex specialities in common eurocode
 CrossSectionCrackedPlate
on - the cross-section is calculated always as cracked
 DecompressionLimit
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992-1-1
 DecompressionLimit_2
The decompression limit requires that all parts of the bonded tendons or duct lie at least 25 mm within concrete in compression for 1992_2
 DecompressionLimit_3
NCI re 7.3.1 (5) In order to keep within the decompression limit, it is required that the concrete surrounding the tendon is in compression over a width of 100 mm or 1/10 of the depth of section (whichever is greater). Stresses are to be checked in state II.
 DetailingBracketMethodType
calculation method of transversal reinforcement
 DivisionStrain
Division of the plane interaction diagram
 EndOfCuring
The age of the concrete (days) at the beginning of drying shrinkage (or swelling) in days. Normally this is at the end of curing.
 Equation629
Equation 6.29 acc. to DIN NCI re 6.3.2 (4)
 Equation631
Equation 6.31 acc. to DIN NCI re 6.3.2 (5)
 FatigueJointCohesion
Under fatigue or dynamic loads, the values for c in 6.2.5 (1) should be halved.
 FatigueMethod
6.8.7 Verification of concrete under compression or shear
 FindOnly2DPlaneDeformation
FindOnly2DPlaneDeformation
 HighStrengthConcrete
High strength concrete for DIN NCI re 3.1.2 (6)
 CheckCrackedCss
Check cracks during shear calculation
 CheckCrossSectionCrackedIfOneCracked_7_2_Chapter
switch if the cross section should be calculated as cracked
 ImperfectionDirection
direction of imperfection for second order effect
 IncreaseJointResistance
the bearing capacity of the reinforcement crossing the joint due to shear friction (third term of the equation) may be increased to become ρ fyd (1,2 μ sin α + cos α).
 InnerPerimeter
Inner perimeter for DIN NCI re 3.1.4 (5)
 InteractionDiagramDivision
division of interaction diagram for export
 InteractionDiagramExportType
type of interaction diagram for export
 InteractionDiagramCheckType
InteractionDiagramCheckType
 InterpolationCurve
type of interpolate curce
 IsSetMrForULSMNKappaDiagram
IsSetMrForULSMNKappaDiagram
 IsSetPrecissionForNullForces
settings if null forces are checked with some precissions
 IterationPrecission
Iteration Precission
 IterationSteps
Iteration Steps
 JointShearStressType
Type of shear stress calculation
 LimitDeflectionAdvanced
limit value of deflection for deflection requrement advanced
 LimitDeflectionNormal
limit value of deflection for deflection requirement normal
 LimitDeflectionValue
limit value as value
 LimitCheckValue
The limit check value, when check is over - check is not satisfactory
 LimitLeverArm
Limit for lever arm acc. to DIN NCI re 6.2.3 (1)
 LinearStiffnessForDeflection
linear stiffness for deflection calculation - only for debug
 MaxBentUpReinfDist
maximum longitudinal spacing of bent-up bars
 MaxDisplayCheckValue
The infinity check value. This will be displayed when the check value equals to infinity or check wasn't calculated.
 MaxHorReinfDistWall
Maximal spacing of horizontal reinforcement
 MaxHorReinfDistWall_EN2_2
maximum horizontal long reinf distance for EN2-2
 MaxLengthOfZone
maximum length of zone to divide member for stiffness calculation
 MaxLongReinfDist
maximum long reinf distance
 MaxLongReinfPercBeam
maximum long reinf percentage
 MaxLongReinfPercBeam_EN2_2
maximum long reinf percentage for EN2-2
 MaxLongReinfPercColumn
maximum long reinf percentage
 MaxMainReinfDistSlab
Maximal spacing of main reinforcement
 MaxMainReinfDistSlab_EN2_2
maximum main long reinf distance for EN2-2
 MaxMainReinfPercSlab
Maximal reinforcement ratio of main reinforcement
 MaxReinfDistDeepBeam
Maximal spacing of reinforcement
 MaxShearReinfDistBeam
maximum shear reinf distance
 MaxShearReinfDistColumn
maximum shear reinf distance
 MaxShearReinfDistSlab
maximum longitudinal spacing of successive series of links for slab
 MaxShearReinfPercBeam
maximum shear reinf percentage
 MaxShearReinfTransDist
maximum shear reinf trans distance
 MaxShearReinfTransDistSlab
maximum transverse spacing of shear reinforcement for slab
 MaxTransReinfDistSlab
Maximal spacing of transverse reinforcement
 MaxTransReinfDistSlab_EN2_2
maximum transversal long reinf distance for EN2-2
 MaxVertReinfDistWall
Maximal spacing of vertical reinforcement
 MaxVertReinfPercWall
Maximal reinforcement ratio of vertical reinforcement
 MinAnchLenShear
minimum anchorage length of shear reinforcement
 MinDuctHorDist
Minimal horizontal distance of ducts
 MinDuctVertDist
Minimal vertical distance of ducts
 MinHorReinfPercWall
Minimal reinforcement ratio of horizontal reinforcement
 MinLongReinfDiamColumn
minimum long reinf diameter
 MinLongReinfDist
minimum long reinf distance
 MinLongReinfPercBeam
detailing beam minimum long reinf percentage
 MinLongReinfPercBeam_EN2_2
minimum long reinf percentage for EN2-2
 MinLongReinfPercColumn
detailing column minimum long reinf percentage
 MinMainReinfPercSlab
Minimal reinforcement ratio of main reinforcement
 MinNoBarCircColumn
minimum number of bars of long reinf
 MinReinfPercDeepBeam
Minimal reinforcement ratio
 MinReinfPercDeepBeam_EN2_2
minimum long reinf percentage for EN2-2
 MinShearReinfDiamColumn
minimum shear reinf diameter
 MinShearReinfDiamColumn_EN2_2
minimum shear reinf diameter EN2-2
 MinShearReinfPercBeam
minimum shear reinf percentage
 MinShearReinfPercSlab
Minimal shear reinforcement percentage for slab
 MinTendonHorDist
Minimal horizontal distance of tendons
 MinTendonVertDist
Minimal vertical distance of tendons
 MinTransReinfPercSlab
Minimal reinforcement ratio of transverse reinforcement
 MinVertReinfPercWall
Minimal reinforcement ratio of vertical reinforcement
 ModulusType
Type of E-modulus, which is used in calculations
 ModulusTypeLongTermEffects
Type of E-modulus, which is used in calculations of long-term effects
 NA_1_Wmax_Ec2
NA_1_Wmax_Ec2
 NA_2_4_2_2_Gamma_p_fav
Partial factors for prestress The value of 􀁊P,fav for use in a Country may be found in its National Annex. The recommended value for persistent and transient design situations is 1,0. This value may also be used for fatigue verification
 NA_2_4_2_2_Gamma_p_unfav
Partial factors for prestress The value of 􀁊P,unfav in the stability limit state for use in a Country may be found in its National Annex. The recommended value for global analysis is 1,3.
 NA_5_10_2_1_1_K1
maximum tendon stress coeff k1 in 5.10.2.1(1)P
 NA_5_10_2_1_1_K2
maximum tendon stress coeff k2 in 5.10.2.1(1)P
 NA_5_10_3_2_K7
maximum tendon stress coeff k7 in 5.10.3(2)
 NA_5_10_3_2_K8
maximum tendon stress coeff k8 in 5.10.3(2)
 NA_5_10_9_r_inf_post
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_10_9_r_inf_pre
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_10_9_r_sup_post
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for post-tensioning with bonded tendons: rsup = 1,10 and rinf = 0,90
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_10_9_r_sup_pre
Effects of prestressing at serviceability limit state and limit state of fatigue The values of rsup and rinf for use in a Country may be found in its National Annex. The recommended values are:
for pre-tensioning or unbonded tendons: rsup = 1,05 and rinf = 0,95
when appropriate measures (e.g. direct measurements of pretensioning) are taken: rsup = rinf = 1,0.
 NA_5_2_5_Theta0
The the basic value of imperfections (See 5.2 (5)).
 NA_5_5_K1
returns K1 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K2
returns K2 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K3
returns K3 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K4
returns K4 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K5
returns K5 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K5_fck_BiggerThan_50MPa
returns K5 coefficient according to DIN EN 1992-2/NA April 2013 NDP re 5.5 (4)
 NA_5_5_K6
returns K6 coefficient according to 5.5 EN 1992-1-1
 NA_5_5_K6_fck_BiggerThan_50MPa
returns K5 coefficient according to DIN EN 1992-2/NA April 2013NDP re 5.5 (4)
 NA_5_8_6_3_GammaCe
Partial safety factor for second order effect design, see 5.8.6 (3).
 NA_6_5_2_3_Ni
coefficient ni - SaT
 NA_6_5_4_4_K1
coefficient k1 - SaT
 NA_6_5_4_4_K2
coefficient k2 - SaT
 NA_6_5_4_4_K3
coefficient k3 - SaT
 NA_7_2_K1
EN 1992-1-1 7.2 (2) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (2)
 NA_7_2_K2
EN 1992-1-1 7.2 (3) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (3)
 NA_7_2_K3
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
 NA_7_2_K4
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
 NA_7_2_K5
EN 1992-1-1 7.2 (5) DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 7.2 (5)
 NA_7_3_1_DecompressionDistance
The durability of prestressed members may be more critically affected by cracking. In the absence of more detailed requirements, it may be assumed that limiting the calculated crack widths to the values of wmax given in Table 7.1N, under the frequent combination of loads, will generally be satisfactory for prestressed concrete members. The decompression limit requires that all parts of the bonded tendons or duct lie at least 100 mm within concrete in compression
 NA_7_3_1_Wmax_Ec2_1_1
NA_7_3_1_Wmax_Ec2_1_1
 NA_7_3_1_Wmax_Ec2_2
NA_7_3_1_Wmax_Ec2_2
 NA_7_3_4_K1
is a coefficient which takes account of the bond properties of the bonded reinforcement
 NA_7_3_4_K2
is a coefficient which takes account of the distribution of strain
 NA_7_3_4_K3
NA_7_3_4_K3
 NA_7_3_4_K4
NA_7_3_4_K4
 NA_8_3_2_MinDiameterOfMandrel
minimal diameter of mandrel acc table 8.1N
 NA_Alphacc_92_1_1
NA_Alphacc_92_1_1
 NA_Alphacc_92_2
NA_Alphacc_92_2
 NA_Alphaccpl_92_1_1
NA_Alphaccpl_92_1_1
 NA_Alphact_92_1_1
NA_Alphact_92_1_1
 NA_Alphact_92_2
NA_Alphact_92_2
 NA_Alphactpl_92_1_1
NA_Alphactpl_92_1_1
 NA_CoeffEpsudByEpsuk
ration of design and characteristics strain limit - reinforcement
 NA_CoeffEpsudByEpsuk_p
ration of design and characteristics strain limit - prestressed reinforcement
 NA_EN1992_3_7_3_1_112_x_min
x lim crack width
 NA_EN1992_3_CrackWidth
crack width limitation
 NA_EN1992_3_CrackWidth_XA2_XA3_XF2_XF3_XF4
crack width limitation
 NA_GammaC
partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaC_BLR
BLR partial factor for concrete for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaCfat
partial factor for concrete for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaFfat
The partial factor for fatigue loads DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (1)
 NA_GammaS
partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaS_BLR
BLR partial factor for reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSfat
partial factor for reinforcement for fatigue - ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSP
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSP_BLR
partial factor for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_GammaSPfat
partial factor for fatigue - for prestressed reinforcement for ULS accidental design situation 2.4.2.4(1) Setup2Values, double, double
 NA_J_3_2_K1
coefficient k1 - SaT bracket
 NA_J_3_3_K2
coefficient k2 - SaT bracket
 NA_k_p
ductility factor for prestressed reinforcement
 NA_K1Fatigue
coefficient k1 for fatigue
 NA_K2Fatigue
6.8.4 (5) Pokud se použijí pravidla 6.8 pro vyhodnocení zbytkové životnosti existující konstrukce nebo pro posouzení potřeby jejího zesílení, pak pokud začala koroze, lze stanovit rozkmit napětí sníženým exponentem napětí k2 pro přímé a ohýbané pruty /// DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.4 (5)
 NA_LimitCharacteristic
limit deformation - characteristics deformation
 NA_LimitInfrequent
limit deformation - infrequent deformation
 NA_LimitQuasiPermanent
limit deformation - quasi-permanent deformation
 NA_LoadDuration
NA_LoadDuration
 NA_NCyclesFatigue
N fatigue cycles 6.8.7 Verification of concrete under compression or shear DIN EN 1992-1-1/NA:2011-01 April 2013 NDP re 6.8.7 (1)
 NA_NN_112_Gamma_sd
coefficient
 NA_Table7_101DE_1992_2
NDP zu 7.3.1 (105) Es gelten Tabelle 7.101DE
 NA_Table7_102DE_1992_2
NDP zu 7.3.1 (105) Es gelten Tabelle 7.102DE
 NA_Table7_103DE_1992_2
NDP zu 7.3.1 (105) Es gelten Tabelle 7.103DE
 NA_TableFatigue6101N
table 6.101N for fatigue - parameters for reinforcement steel - Dutch annex
 NA_TableFatigue63N
table 6.3N for fatigue - parameters for reinforcement steel DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.3N
 NA_TableFatigue63N_1992_2
table 6.3N for fatigue - parameters for reinforcement steel DIN EN 1992-2/NA 2013 NCI re 6.8.4, Table 6.3N
 NA_TableFatigue64N
table 6.4N for fatigue - parameters for prestress steel DIN EN 1992-1-1/NA:2011-01 April 2013 NCI re 6.8.4, Table 6.4N
 NA_TableFatigue64N_1992_2
table 6.4N for fatigue - parameters for prestress steel DIN EN 1992-2/NA April 2013 NCI re 6.8.4, Table 6.4N
 NeglectRedistributionOfMoments
Neglect redistribution of moments My, Mz, if the ratio My/Mz is less than 10%
 NonlinearCreep
calculation of non-linear creep
 NoResistanceOfConcreteInTension1D
No resistance of concrete in tension - members 1D
 NoResistanceOfConcreteInTension2D
No resistance of concrete in tension - plates
 NoTendonExclusion
dont exclude tendons from calculation model of cross-section
 NumberPartsOfDM
number of parts on design member
 PlaneDiagramCount
Number of the plane interaction diagrams
 SaTMethodType
type of SAT method
 SetupTable45n1991_2
table 4.5(n) acc 1991-2 - Indicative number of heavy vehicles expected per year and per slow lane
 SimplifiedCssModel
Use simplified calculation model of cross-section (reinforcement bars in layers are substituted by rectangle polygon component)
 StressLimit_TypeFctm
stress limitation - type calculation of concrete stress limitation in tension
 StrutAngleOptimalization
calculate optimalization of strut angle in shear, torsion and interaction
 SubintervalsPerDecade
Minimal number of time nodes per decade
 Table74N
Values in table 74N
 Table74N_1992_1_1
Values in table 74N
 TableJointParameters
6.2.5 (2) Parameters of joint
 Theta
Theta
 Theta_c
lateral shear - angle theta - compressed flange
 Theta_max_f
lateral shear - max angle theta
 Theta_min_c
lateral shear - min angle theta - compressed flange
 Theta_min_t
lateral shear - min angle theta - tensioned flange
 Theta_t
lateral shear - angle theta - tensioned flange
 ThetaMax
ThetaMax
 ThetaMin
ThetaMin
 TypeOfInitialstateOfCSS
TypeOfInitialstateOfCSS
 TypeSLSCalculation
set of SLS calculation 0 - both 1 - short-term 2 - long-term
 UseGammalt
The safety factor for long-term extrapolation of delayed strains, see Ec2-2 B.105. Is used for calculation of creep effect. The value Gamma lt is calculated.
 UserValuesForShear
User values for shear calculation - d and z
 VestigalResistance
Vestigal resistance
 WeakenedByBars
weakened by bars - all bars area is subtract for concrete area
 WeakenedByDucts
weakened by ducts - all ducts area is subtract for concrete area
 WeakenedByTendons
weakened by tendons - all tendons area is subtract for concrete area
 Improve this Doc
 View Source